# DMA Lab: Pandas Basics Demo Session

## Pandas

* *pandas* is a Python library for data analysis. 
* It offers a number of data exploration, cleaning and transformation operations that are critical in working with data in Python. 

* *pandas* build upon *numpy* and *scipy* providing easy-to-use data structures and data manipulation functions with integrated indexing.

* The main data structures *pandas* provides are *Series* and *DataFrames*. 


**Recommended Resources:**
* *pandas* Documentation: http://pandas.pydata.org/pandas-docs/stable/
* *Python for Data Analysis* by Wes McKinney
* *Python Data Science Handbook* by Jake VanderPlas

Let's get started with our first *pandas* notebook!

### Import Pandas and Numpy Libraries

In [1]:
import pandas as pd
import numpy as np

### Introduction to pandas Data Structures

* *pandas* has two main data structures it uses, namely, *Series* and *DataFrames*.

### pandas Series
- one-dimensional labeled array.

### Creating a Series by passing a list of values, letting pandas create a default integer index

In [27]:
data = np.array([1, 3, 5, np.nan, 6, 8])
s = pd.Series(data)
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [13]:
s.index

RangeIndex(start=0, stop=6, step=1)

In [28]:
print(s[:2])

0    1.0
1    3.0
dtype: float64

### Creating a series with 'object' data type index

In [21]:
ser = pd.Series([100, 'foo', 300, 'bar', 500], index=['tom', 'bob', 'nancy', 'dan', 'eric'])

In [22]:
print(ser)

tom      100
bob      foo
nancy    300
dan      bar
eric     500
dtype: object

In [23]:
ser.index

Index(['tom', 'bob', 'nancy', 'dan', 'eric'], dtype='object')

In [14]:
ser.loc[['nancy','bob']]                #label-location based indexer for selection by label

nancy    300
bob      foo
dtype: object

In [15]:
ser[[4, 3, 1]]

eric    500
dan     bar
bob     foo
dtype: object

In [16]:
ser.iloc[2]                            #integer-location based indexing for selection by position

300

In [17]:
'bob' in ser

True

In [18]:
ser

tom      100
bob      foo
nancy    300
dan      bar
eric     500
dtype: object

In [19]:
ser * 2

tom         200
bob      foofoo
nancy       600
dan      barbar
eric       1000
dtype: object

In [20]:
ser[['nancy', 'eric']] ** 2

nancy     90000
eric     250000
dtype: object

### pandas DataFrame
- *pandas DataFrame* is a 2-dimensional labeled data structure.

### Create DataFrame from dictionary of Python Series

In [30]:
d = {'one' : pd.Series([100., 200., 300.], index=['apple', 'ball', 'clock']),
     'two' : pd.Series([111., 222., 333., 4444.], index=['apple', 'ball', 'cerill', 'dancy'])}
print(d)

{'one': apple    100.0
ball     200.0
clock    300.0
dtype: float64, 'two': apple      111.0
ball       222.0
cerill     333.0
dancy     4444.0
dtype: float64}

In [36]:
df = pd.DataFrame(d)
df

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [32]:
df.index

Index(['apple', 'ball', 'cerill', 'clock', 'dancy'], dtype='object')

In [33]:
df.columns

Index(['one', 'two'], dtype='object')

In [34]:
pd.DataFrame(d, index=['dancy', 'ball', 'apple'])

         one     two
dancy    NaN  4444.0
ball   200.0   222.0
apple  100.0   111.0

In [37]:
pd.DataFrame(d, index=['dancy', 'ball', 'apple'], columns=['two', 'five'])

          two five
dancy  4444.0  NaN
ball    222.0  NaN
apple   111.0  NaN

### Create DataFrame from list of Python dictionaries

In [40]:
data = [{'alex': 1, 'joe': 2}, {'ema': 5, 'dora': 10, 'alice': 20}]
data

[{'alex': 1, 'joe': 2}, {'ema': 5, 'dora': 10, 'alice': 20}]

In [39]:
pd.DataFrame(data)

   alex  alice  dora  ema  joe
0   1.0    NaN   NaN  NaN  2.0
1   NaN   20.0  10.0  5.0  NaN

In [41]:
pd.DataFrame(data, index=['orange', 'red'])

        alex  alice  dora  ema  joe
orange   1.0    NaN   NaN  NaN  2.0
red      NaN   20.0  10.0  5.0  NaN

In [42]:
pd.DataFrame(data, columns=['joe', 'dora','alice'])

   joe  dora  alice
0  2.0   NaN    NaN
1  NaN  10.0   20.0

### Basic DataFrame operations

In [43]:
df

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [44]:
df['one']

apple     100.0
ball      200.0
cerill      NaN
clock     300.0
dancy       NaN
Name: one, dtype: float64

In [45]:
df['three'] = df['one'] * df['two']
df

          one     two    three
apple   100.0   111.0  11100.0
ball    200.0   222.0  44400.0
cerill    NaN   333.0      NaN
clock   300.0     NaN      NaN
dancy     NaN  4444.0      NaN

In [46]:
df['flag'] = df['one'] > 250
df

          one     two    three   flag
apple   100.0   111.0  11100.0  False
ball    200.0   222.0  44400.0  False
cerill    NaN   333.0      NaN  False
clock   300.0     NaN      NaN   True
dancy     NaN  4444.0      NaN  False

In [47]:
three = df.pop('three')

In [48]:
three

apple     11100.0
ball      44400.0
cerill        NaN
clock         NaN
dancy         NaN
Name: three, dtype: float64

In [49]:
df

          one     two   flag
apple   100.0   111.0  False
ball    200.0   222.0  False
cerill    NaN   333.0  False
clock   300.0     NaN   True
dancy     NaN  4444.0  False

In [50]:
del df['two']

In [51]:
df

          one   flag
apple   100.0  False
ball    200.0  False
cerill    NaN  False
clock   300.0   True
dancy     NaN  False

In [52]:
df.insert(2, 'copy_of_one', df['one'])
df

          one   flag  copy_of_one
apple   100.0  False        100.0
ball    200.0  False        200.0
cerill    NaN  False          NaN
clock   300.0   True        300.0
dancy     NaN  False          NaN

In [53]:
df['one_upper_half'] = df['one'][:2]
df

          one   flag  copy_of_one  one_upper_half
apple   100.0  False        100.0           100.0
ball    200.0  False        200.0           200.0
cerill    NaN  False          NaN             NaN
clock   300.0   True        300.0             NaN
dancy     NaN  False          NaN             NaN

## Reference on Pandas for more details
    - http://pandas.pydata.org/pandas-docs/stable/

### Exercise Questions

#### Exercise 1.1

In [3]:
# Display the summary of the dataframe
import pandas as pd
exam_data = {'name': ['Alexa', 'Rocky', 'Sunny', 'James', 'Michael', 'Laura'],
             'score': [45, 9, 25, 0, 18, 20],     
             'eligibility': ['yes', 'no', 'yes', 'no', 'no', 'yes']}

df = pd.DataFrame(exam_data)


print("Summary of the basic information about this DataFrame and its data:")

## START CODE HERE

print(df.info())

##END CODE HERE

Summary of the basic information about this DataFrame and its data:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
name           6 non-null object
score          6 non-null int64
eligibility    6 non-null object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes
None

#### Exercise 1.2

In [ ]:
# Display the first 2 records of the given dataframe

exam_data = {'name': ['Alexa', 'Rocky', 'Sunny', 'James', 'Michael', 'Laura'],
             'score': [45, 9, 25, 0, 18, 20],     
             'eligibility': ['yes', 'no', 'yes', 'no', 'no', 'yes']}

df = pd.DataFrame(exam_data)

## START CODE HERE


##END CODE HERE

#### Exercise 1.3

In [ ]:
# Fetch the rows of the dataframe where the score is missing

exam_data = {'name': ['Alexa', 'Rocky', 'Sunny', 'James', 'Michael', 'Laura'],
             'score': [45, 9, 25, np.nan, 18, 20],     
             'eligibility': ['yes', 'no', 'yes', 'no', 'no', 'yes']}

df = pd.DataFrame(exam_data)

## START CODE HERE


##END CODE HERE

#### Exercise 1.4

In [ ]:
# Calculate the mean of scores of all the students

exam_data = {'name': ['Alexa', 'Rocky', 'Sunny', 'James', 'Michael', 'Laura'],
             'score': [45, 9, 25, np.nan, 18, 20],     
             'eligibility': ['yes', 'no', 'yes', 'no', 'no', 'yes']}

df = pd.DataFrame(exam_data)

## START CODE HERE


##END CODE HERE

#### Exercise 1.5

In [ ]:
# Replace the â€˜eligibility' column values which consists of 'yes' and 'no' with 'True' and 'False' values.

exam_data = {'name': ['Alexa', 'Rocky', 'Sunny', 'James', 'Michael', 'Laura'],
             'score': [45, 9, 25, np.nan, 18, 20],     
             'eligibility': ['yes', 'no', 'yes', 'no', 'no', 'yes']}

df = pd.DataFrame(exam_data)

## START CODE HERE
df['eligibility'] = df['eligibility'].map({'yes': True, 'no': False})

##END CODE HERE

print(df)

#### Exercise 1.6

In [ ]:
# Sort the dataframe first by 'name' in descending order, then by 'score' in ascending order.

exam_data = {'name': ['Alexa', 'Rocky', 'Sunny', 'James', 'Michael', 'Laura'],
             'score': [45, 9, 25, np.nan, 18, 20],     
             'eligibility': ['yes', 'no', 'yes', 'no', 'no', 'yes']}

df = pd.DataFrame(exam_data)

## START CODE HERE


##END CODE HERE

print(df)